app/controllers/shows_controller.rb

  def show
    @show = Show.find(params[:id])
    @comments = @show.comments
    @bands = @show.bands
    @headliner = @bands.at(0)
    @posted_by = User.find(@show.posted_by)
---
SELECT * FROM "comments" WHERE ("comments".show_id = 61)