app/controllers/shows_controller.rb

SELECT * FROM "locations" WHERE (city = 'Seattle' and state = 'Washington') LIMIT 1
SELECT * FROM "shows" INNER JOIN "shows_users" ON "shows".id = "shows_users".show_id WHERE ("shows_users".user_id = 1 )
---
  def index
      city = getCityOfUser()
      state = getStateOfUser()

      location = Location.find(:first, :conditions => ["city = ? and state = ?", city, state])
      @shows = location.shows.find(:all, :conditions => ['date > ?', Date.current - 1.day ], :order => 'date ASC, attending DESC')

SELECT * FROM "shows" WHERE ("shows"."id" = 63)
SELECT * FROM "bands" INNER JOIN "bands_shows" ON "bands".id = "bands_shows".band_id WHERE ("bands_shows".show_id = 63 )
---
  def show
    @show = Show.find(params[:id])
    @comments = @show.comments
    @bands = @show.bands
    @headliner = Band.find(@bands.at(0).id)

INSERT INTO "comments" ("created_at", "updated_at", "user_comment", "user_id", "show_id") VALUES('2010-01-17 05:01:17', '2010-01-17 05:01:17', '<p><strong>This Works.</strong> Hello</p>', 1, NULL)
UPDATE "comments" SET "show_id" = 66, "updated_at" = '2010-01-17 05:00:57' WHERE "id" = 3
SELECT * FROM "shows" WHERE ("shows"."id" = 66)
---
  def LeaveComment

    #create a new comment
    @comment = Comment.new
    user_comment = params[:comment]
    #comment_to_insert = ERB::Util.html_escape(params[:comment])
    @comment.user_comment = user_comment

    #add the comment to the user
    @user = get_current_user
    @user.add_comment_to_user(@comment)
    @user.save

    #add the comment to the show
    @show = Show.find(params[:id])

SELECT * FROM "shows" WHERE ("shows"."id" = 65)
---
  def edit
    @show = Show.find(params[:id])

SELECT * FROM "locations" WHERE (city = 'Seattle' and state = 'Washington') LIMIT 1
INSERT INTO "bands" ("band_name") VALUES('Hocky')
SELECT * FROM "venues" WHERE (name = 'The Vera Project') LIMIT 1
SELECT * FROM "bands" WHERE (band_name = 'Hocky') LIMIT 1
INSERT INTO "shows" ("price", "created_at", "showtime", "updated_at", "time", "venue_id", "date", "location_id", "advanceprice", "description", "attending", "allowed_in") VALUES(9.0, '2010-01-13 16:38:27', NULL, '2010-01-13 16:38:27', '7:30 PM', NULL, '2010-01-13', NULL, NULL, NULL, 0, 'All Ages')
UPDATE "shows" SET "location_id" = 1, "updated_at" = '2010-01-13 16:38:27' WHERE "id" = 63
---
  def create
    @userCity = getCityOfUser()
    @userState = getStateOfUser()
    @venueName = params[:name_of_venue]

    @location = Location.find(:first, :conditions => ["city = ? and state = ?", @userCity, @userState])

    @show = Show.new(params[:show])

    if(@venueName == "")  then @show.throw_error("How will there be a show without a venue?") end

    @form_band_list_array = [:band1, :band2, :band3, :band4, :band5, :band6, :band7, :band8, :band9, :band10]
    @band_array = []
    @form_band_list_array.each do |form_element|
      if(params[form_element] != '')
        @show.add_band_to_show(params[form_element])
        @band_array.push(params[form_element])
      end
    end

    respond_to do |format|

      @venue = Venue.find(:first, :conditions=> ["name = ?", @venueName] )

     if @show.errors.size > 0

        format.html { render :action => "new" }
        format.xml  { render :xml => @show.errors, :status => :unprocessable_entity }

      elsif @show.save

        @venue.add_show_to_venue(@show)
        @venue.save

SELECT * FROM "shows" WHERE ("shows"."id" = 64)
UPDATE "shows" SET "updated_at" = '2010-01-14 17:14:23', "attending" = 1 WHERE "id" = 64
SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def increment_attending

    @on_show_detail_page = params[:show_detail_page]

    #check first to see if already attending show
    if already_attending?(params[:user_id], params[:id])
      @show = Show.find(params[:id])
      @current_show = @show
      @show.attending = @show.attending - 1
      @show.user_not_attending(get_current_user())

      @show.save
      @attending_show_already = true
    else

      @attending_show_already = false

      @show = Show.find(params[:id])

SELECT * FROM "locations" WHERE (city = 'Seattle' and state = 'Washington') LIMIT 1
SELECT * FROM "venues" WHERE (name = 'hello' and location_id = 1) LIMIT 1
---
  def venue_changed

     city = getCityOfUser()
     state = getStateOfUser()

     @venueFound = "false"
     @isPartialMatch = "false"
     @venueName = params[:venueName]

     @location = Location.find(:first, :conditions => ["city = ? and state = ?", city, state])
     @venue = Venue.find(:first, :conditions => ["name = ? and location_id = ?", @venueName, @location.id] )

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def set_current_user_if_logged_in
    if(session[:user_id])
      @current_user = User.find(session[:user_id])