app/controllers/venues_controller.rb

  def show
    @venue = Venue.find(params[:id])
---
SELECT * FROM "venues" WHERE ("venues"."id" = 9)

  def edit
    @venue = Venue.find(params[:id])
---
SELECT * FROM "venues" WHERE ("venues"."id" = 9)

  def create
    @venue = Venue.new(params[:venue])

    if(@venue.name != nil) then
      @venue.name = @venue.name.upcase
    end

    @userCity = get_user_city()
    @userState = get_user_state()

    @location = Location.city_equals(@userCity).state_equals(@userState).first
    @venue.location_id = @location.id

    respond_to do |format|
      if @venue.save
---
INSERT INTO "venues" ("name", "address", "location_id", "phone", "website") VALUES(NULL, NULL, NULL, NULL, NULL)

  def destroy
    @venue = Venue.find(params[:id])
    @venue.destroy
---
SELECT * FROM "venues" WHERE ("venues"."id" = 9)
DELETE FROM "venues" WHERE "id" = 9